#+title: org-special-block-extras
#+author: Musa Al-hassy
#+PROPERTY: header-args:emacs-lisp :tangle org-special-block-extras.el
#+options: d:nil
#+LATEX_HEADER: \usepackage[hmargin=15mm,top=15mm,bottom=15mm]{geometry}

* COMMENT MELPA Checks
  :PROPERTIES:
  :CUSTOM_ID: COMMENT-MELPA-Checks
  :END:
1. In Github repo: Create new file ⇒ License.txt ⇒ Select template ⇒ GNU 3
2. Ensure first line ends with: -*- lexical-binding: t; -*-
3. Include approriate standard keywords;
   #+begin_src emacs-lisp
(pp finder-known-keywords)
   #+end_src

   #+RESULTS:
   #+begin_example
   ((abbrev . "abbreviation handling, typing shortcuts, and macros")
    (bib . "bibliography processors")
    (c . "C and related programming languages")
    (calendar . "calendar and time management tools")
    (comm . "communications, networking, and remote file access")
    (convenience . "convenience features for faster editing")
    (data . "editing data (non-text) files")
    (docs . "Emacs documentation facilities")
    (emulations . "emulations of other editors")
    (extensions . "Emacs Lisp language extensions")
    (faces . "fonts and colors for text")
    (files . "file editing and manipulation")
    (frames . "Emacs frames and window systems")
    (games . "games, jokes and amusements")
    (hardware . "interfacing with system hardware")
    (help . "Emacs help systems")
    (hypermedia . "links between text or other media types")
    (i18n . "internationalization and character-set support")
    (internal . "code for Emacs internals, build process, defaults")
    (languages . "specialized modes for editing programming languages")
    (lisp . "Lisp support, including Emacs Lisp")
    (local . "code local to your site")
    (maint . "Emacs development tools and aids")
    (mail . "email reading and posting")
    (matching . "searching, matching, and sorting")
    (mouse . "mouse support")
    (multimedia . "images and sound")
    (news . "USENET news reading and posting")
    (outlines . "hierarchical outlining and note taking")
    (processes . "processes, subshells, and compilation")
    (terminals . "text terminals (ttys)")
    (tex . "the TeX document formatter")
    (tools . "programming tools")
    (unix . "UNIX feature interfaces and emulators")
    (vc . "version control")
    (wp . "word processing"))
   #+end_example
4. Use #' instead of ' for function symbols
5. Use ‘-’ as a separator, not ‘/’.
6. =M-x checkdoc= on the lisp file to ensure it passes expected style issues.
7. Ensure that package-linter raises no issues; i.e., the following has no result.
    #+BEGIN_SRC emacs-lisp
(use-package package-lint)
(-let [it "org-special-block-extras.el"]
 (ignore-errors (kill-buffer it))
 (find-file-other-window it)
 (package-lint-buffer it))
#+END_SRC
8. Create a recipe file by invoking: M-x package-build-create-recipe
   - Place it in: melpa/recipes/
   - The name of the file should be the name of the package, no extension.

      #+BEGIN_SRC emacs-lisp :tangle ~/melpa/recipes/org-special-block-extras
   (org-special-block-extras :fetcher github :repo "alhassy/org-special-block-extras")
   #+END_SRC
9. Ensure the recipe builds successfully:
   #+BEGIN_SRC shell
   cd ~/melpa; make recipes/org-special-block-extras
   #+END_SRC

8.

(insert   package-build-archive-dir)
/Users/musa/.emacs.d/elpa/packages/
